In [1]:
import pandas as pd

In [3]:
data= pd.read_csv('Ouvrir excel via python.csv', sep= ';')

In [4]:
data.head(10)

       Prénom  Âge       Voiture          Sexe                Loisirs
0       Alice   28      Peurgeot       Féminin          Jouer au foot
1     Clément   26      Mercedes      Masculin              Jardinage
2     Mathieu   23         Dacia           NaN             équitation
3  Christophe   27          Clio      Masculin            Jeux vidéos
4        Sana   27         Chloé           NaN      Course de voiture
5     Patrice   20           NaN      Masculin                    NaN
6      kylian   27        Subaru      Masculin            Gastronomie

In [42]:
data.shape #Donne le nombre de colonne et ligne

(7, 5)

In [43]:
data.info #montre le tableau sous une autre forme

<bound method DataFrame.info of        Prénom  Âge       Voiture          Sexe                Loisirs
0       Alice   28      Peurgeot       Féminin          Jouer au foot
1     Clément   26      Mercedes      Masculin              Jardinage
2     Mathieu   23         Dacia           NaN             équitation
3  Christophe   27          Clio      Masculin            Jeux vidéos
4        Sana   27         Chloé           NaN      Course de voiture
5     Patrice   20           NaN      Masculin                    NaN
6      kylian   27        Subaru      Masculin            Gastronomie>

In [44]:
data.isnull().sum() #donne le nombre de valeur null dans chaque colonne

Prénom     0
Âge        0
Voiture    1
Sexe       2
Loisirs    1
dtype: int64

In [46]:
data.style.highlight_null(null_color='red')

In [47]:
data.dropna()

       Prénom  Âge       Voiture      Sexe        Loisirs
0       Alice   28      Peurgeot   Féminin  Jouer au foot
1     Clément   26      Mercedes  Masculin      Jardinage
3  Christophe   27          Clio  Masculin    Jeux vidéos
6      kylian   27        Subaru  Masculin    Gastronomie